Repository: irinsultanapoly/CSE-Lab-Courses
Catalog: Capstone-Project/App/lib/l10n/app_*.arb
Languages: bn

# appTitle
source: BAGANI
bn: বাগানি

source: Home
bn: হোম

source: Detection
bn: রোগ নির্ণয়

source: Treatment
bn: চিকিৎসা

source: Profile
bn: প্রোফাইল

# welcomeMessage
source: Welcome to Plant Care
bn: উদ্ভিদ পরিচর্যায় স্বাগতম

# appDescription
source: AI-powered disease detection and treatment recommendations
bn: এআই-চালিত রোগ নির্ণয় এবং চিকিৎসার সুপারিশ

source: Detect Disease
bn: রোগ নির্ণয় করুন

# detectDiseaseDesc
source: Take a photo to identify plant diseases
bn: উদ্ভিদের রোগ চিহ্নিত করতে ছবি তুলুন

source: Get Treatment
bn: চিকিৎসা পান

# getTreatmentDesc
source: AI-powered treatment recommendations
bn: এআই-চালিত চিকিৎসার সুপারিশ

source: Plant Analytics
bn: উদ্ভিদ বিশ্লেষণ

# plantAnalyticsDesc
source: Track your plant health over time
bn: সময়ের সাথে আপনার উদ্ভিদের স্বাস্থ্য ট্র্যাক করুন

source: Plant Guide
bn: উদ্ভিদ গাইড

# plantGuideDesc
source: Learn about plant care and diseases
bn: উদ্ভিদ পরিচর্যা এবং রোগ সম্পর্কে জানুন

# yourAiCompanion
source: Your AI Plant Care Companion
bn: আপনার এআই উদ্ভিদ পরিচর্যা সহকারী

source: Scan Your Plant
bn: আপনার উদ্ভিদ স্ক্যান করুন

# aiPoweredIdentification
source: AI-powered plant disease identification
bn: এআই-চালিত উদ্ভিদ রোগ শনাক্তকরণ

source: Your Plants
bn: আপনার উদ্ভিদসমূহ

source: View All
bn: সব দেখুন

source: No Recent Scans
bn: কোন সাম্প্রতিক স্ক্যান নেই

# startScanning
source: Start scanning your plants to see them here
bn: আপনার উদ্ভিদ স্ক্যান করা শুরু করুন এগুলো এখানে দেখতে

# startScanningButton
source: Start Scanning
bn: স্ক্যানিং শুরু করুন

source: Scan Now
bn: এখনই স্ক্যান করুন

source: History
bn: ইতিহাস

source: Care Guide
bn: যত্ন গাইড

source: Plants
bn: গাছপালা

source: Healthy
bn: সুস্থ

source: Need Care
bn: যত্ন প্রয়োজন

source: Recent Detections
bn: সাম্প্রতিক সনাক্তকরণ

source: Today
bn: আজ

source: Yesterday
bn: গতকাল

# daysAgo
source: {days} days ago
bn: {days} দিন আগে

source: Quick Care Tips
bn: দ্রুত যত্ন পরামর্শ

source: Watering
bn: জল দেওয়া

# wateringDescription
source: Check soil moisture before watering. Most plants prefer slightly dry soil between watering.
bn: জল দেওয়ার আগে মাটির আর্দ্রতা পরীক্ষা করুন। বেশিরভাগ গাছপালা জল দেওয়ার মধ্যে সামান্য শুকনো মাটি পছন্দ করে।

source: Sunlight
bn: সূর্যালোক

# sunlightDescription
source: Place plants near windows for natural light. Rotate weekly for even growth.
bn: প্রাকৃতিক আলোর জন্য গাছপালা জানালার কাছে রাখুন। সমান বৃদ্ধির জন্য সাপ্তাহিকভাবে ঘুরান।

source: Temperature
bn: তাপমাত্রা

# temperatureDescription
source: Keep plants away from heat sources and cold drafts. Room temperature is usually ideal.
bn: গাছপালা তাপ উৎস এবং ঠান্ডা বাতাস থেকে দূরে রাখুন। সাধারণত ঘরের তাপমাত্রা আদর্শ।

source: Plant Categories
bn: উদ্ভিদ বিভাগসমূহ

source: Loading care guides...
bn: যত্ন গাইড লোড হচ্ছে...

source: Failed to load care guides
bn: যত্ন গাইড লোড করতে ব্যর্থ

source: Guides
bn: গাইডসমূহ

source: Care Requirements
bn: যত্নের প্রয়োজনীয়তা

source: Light
bn: হালকা

source: Water
bn: জল

source: Humidity
bn: আর্দ্রতা

source: Soil
bn: মাটি

source: Fertilizer
bn: সার

source: Care Tips
bn: যত্নের পরামর্শ

source: Common Issues
bn: সাধারণ সমস্যা

source: Houseplants
bn: ঘরের গাছপালা

# houseplantsDescription
source: Indoor plants for home decoration and air purification
bn: ঘরের সাজসজ্জা এবং বায়ু শুদ্ধিকরণের জন্য অভ্যন্তরীণ গাছপালা

source: Vegetables
bn: সবজি

# vegetablesDescription
source: Edible plants for home gardening and fresh produce
bn: ঘরের বাগান এবং তাজা উৎপাদনের জন্য খাদ্য গাছপালা

source: Flowers
bn: ফুল

# flowersDescription
source: Beautiful flowering plants for gardens and decoration
bn: বাগান এবং সাজসজ্জার জন্য সুন্দর ফুলের গাছপালা

source: Very Easy
bn: খুব সহজ

source: Easy
bn: সহজ

source: Moderate
bn: মাঝারি

source: Difficult
bn: কঠিন

# takePhotoDescription
source: Take a photo of your plant to detect diseases and get treatment recommendations
bn: রোগ শনাক্ত করতে এবং চিকিৎসার সুপারিশ পেতে আপনার উদ্ভিদের ছবি তুলুন

source: Take Photo
bn: ছবি তুলুন

source: Choose from Gallery
bn: গ্যালারি থেকে বেছে নিন

source: Analyze
bn: বিশ্লেষণ করুন

source: Remove Image
bn: ছবি সরান

source: Analyzing Plant...
bn: উদ্ভিদ বিশ্লেষণ হচ্ছে...

# detectingDiseases
source: Detecting diseases and generating solutions
bn: রোগ শনাক্ত করা এবং সমাধান তৈরি করা হচ্ছে

source: Tips for better scanning
bn: ভাল স্ক্যানিংয়ের জন্য পরামর্শ

# scanningTips
source: • Take clear, well-lit photos of a single leaf or plant part • Avoid backgrounds with other plants or objects • Make sure the diseased area is visible and in focus
bn: • ভাল আলো ব্যবহার করুন • আক্রান্ত এলাকায় ফোকাস করুন • ক্যামেরা স্থির রাখুন

source: Prediction Result
bn: ভবিষ্যদ্বাণীর ফলাফল

source: Prediction:
bn: ভবিষ্যদ্বাণী:

# confidence
source: Confidence: {percentage}%
bn: আত্মবিশ্বাস: {percentage}%

source: Get Solution from AI
bn: এআই থেকে সমাধান পান

source: Cure Suggestion
bn: চিকিৎসার পরামর্শ

source: Steps:
bn: ধাপসমূহ:

source: Tips:
bn: পরামর্শসমূহ:

# forBestResults
source: For best results, ensure clear images and good lighting. Tap below to get AI-powered solutions for this disease.
bn: সেরা ফলাফলের জন্য, পরিষ্কার ছবি এবং ভাল আলো নিশ্চিত করুন। এই রোগের জন্য এআই-চালিত সমাধান পেতে নীচে ট্যাপ করুন।

# noStructuredCureSuggestion
source: No structured cure suggestion could be generated for this disease.
bn: এই রোগের জন্য কোন কাঠামোগত চিকিৎসার পরামর্শ তৈরি করা যায়নি।

# failedToFetchSuggestion
source: Failed to fetch suggestion: {error}
bn: পরামর্শ আনতে ব্যর্থ: {error}

source: Detection History
bn: শনাক্তকরণের ইতিহাস

# noCureSuggestionAvailable
source: No cure suggestion available for this disease.
bn: এই রোগের জন্য কোন চিকিৎসার পরামর্শ নেই।

# failedToLoadCureSuggestion
source: Failed to load cure suggestion: {error}
bn: চিকিৎসার পরামর্শ লোড করতে ব্যর্থ: {error}

source: Edit Profile
bn: প্রোফাইল সম্পাদনা করুন

source: Sign Out
bn: সাইন আউট

source: Clear Saved Credentials
bn: সংরক্ষিত পরিচয়পত্র মুছুন

source: Delete Account
bn: অ্যাকাউন্ট মুছুন

source: Processing...
bn: প্রক্রিয়াকরণ হচ্ছে...

# signOutConfirm
source: Are you sure you want to sign out?
bn: আপনি কি নিশ্চিত যে আপনি সাইন আউট করতে চান?

source: Cancel
bn: বাতিল

# deleteAccountConfirm
source: Are you sure you want to delete your account? This action cannot be undone and all your data will be permanently lost.
bn: আপনি কি নিশ্চিত যে আপনি আপনার অ্যাকাউন্ট মুছতে চান? এই কাজটি পূর্বাবস্থায় ফেরানো যাবে না এবং আপনার সমস্ত ডেটা স্থায়ীভাবে হারিয়ে যাবে।

source: Delete
bn: মুছুন

# clearCredentialsConfirm
source: Are you sure you want to clear all saved credentials? You will need to enter them again next time.
bn: আপনি কি নিশ্চিত যে আপনি সমস্ত সংরক্ষিত পরিচয়পত্র মুছতে চান? পরের বার আপনাকে আবার এগুলো লিখতে হবে।

source: Clear
bn: মুছুন

source: Sign out failed:
bn: সাইন আউট ব্যর্থ:

source: Account deletion failed:
bn: অ্যাকাউন্ট মুছে ফেলা ব্যর্থ:

# clearCredentialsFailed
source: Failed to clear credentials:
bn: পরিচয়পত্র মুছতে ব্যর্থ:

# savedCredentialsCleared
source: Saved credentials cleared successfully
bn: সংরক্ষিত পরিচয়পত্র সফলভাবে মুছে ফেলা হয়েছে

source: Updating language...
bn: ভাষা আপডেট হচ্ছে...

# languageUpdatedTo
source: Language updated to {language}
bn: ভাষা আপডেট হয়েছে: {language}

# failedToUpdateLanguage
source: Failed to update language: {error}
bn: ভাষা আপডেট করতে ব্যর্থ: {error}

source: Updating theme...
bn: থিম আপডেট হচ্ছে...

# themeUpdatedTo
source: Theme updated to {theme}
bn: থিম আপডেট হয়েছে: {theme}

# failedToUpdateTheme
source: Failed to update theme: {error}
bn: থিম আপডেট করতে ব্যর্থ: {error}

# followsDeviceSettings
source: Follows your device settings
bn: আপনার ডিভাইসের সেটিংস অনুসরণ করে

# lightThemeDescription
source: Light theme for bright environments
bn: উজ্জ্বল পরিবেশের জন্য হালকা থিম

# darkThemeDescription
source: Dark theme for low-light environments
bn: কম আলোর পরিবেশের জন্য গাঢ় থিম

source: Frequently Asked Questions
bn: সর্বাধিক জিজ্ঞাসিত প্রশ্ন

source: How to detect plant diseases?
bn: গাছের রোগ কীভাবে শনাক্ত করবেন?

# diseaseDetectionAnswer
source: Take a photo of your plant's affected area using the camera feature. Our AI will analyze the image and provide disease identification with treatment recommendations.
bn: ক্যামেরা ফিচার ব্যবহার করে আপনার গাছের আক্রান্ত অংশের ছবি তুলুন। আমাদের AI ছবিটি বিশ্লেষণ করে রোগ শনাক্তকরণ এবং চিকিৎসার পরামর্শ দেবে।

# howAccurateIsDetection
source: How accurate is the disease detection?
bn: রোগ শনাক্তকরণ কতটা সঠিক?

# detectionAccuracyAnswer
source: Our AI model has been trained on thousands of plant disease images and achieves high accuracy. However, for critical cases, we recommend consulting with a plant expert.
bn: আমাদের AI মডেল হাজার হাজার গাছের রোগের ছবি দিয়ে প্রশিক্ষিত এবং উচ্চ নির্ভুলতা অর্জন করে। তবে গুরুতর ক্ষেত্রে, আমরা একজন গাছ বিশেষজ্ঞের সাথে পরামর্শ করার পরামর্শ দিই।

# canISaveDetectionHistory
source: Can I save my detection history?
bn: আমি কি আমার শনাক্তকরণের ইতিহাস সংরক্ষণ করতে পারি?

# detectionHistoryAnswer
source: Yes! All your detections are automatically saved and can be accessed from the Detection History tab. You can view past results and treatment recommendations.
bn: হ্যাঁ! আপনার সমস্ত শনাক্তকরণ স্বয়ংক্রিয়ভাবে সংরক্ষিত হয় এবং Detection History ট্যাব থেকে অ্যাক্সেস করা যায়। আপনি পূর্ববর্তী ফলাফল এবং চিকিৎসার পরামর্শ দেখতে পারেন।

# howToGetTreatment
source: How to get treatment recommendations?
bn: চিকিৎসার পরামর্শ কীভাবে পাবেন?

# treatmentRecommendationsAnswer
source: After detecting a disease, you'll receive detailed treatment recommendations including care guides, preventive measures, and recovery tips.
bn: রোগ শনাক্ত করার পর, আপনি বিস্তারিত চিকিৎসার পরামর্শ পাবেন যার মধ্যে যত্নের গাইড, প্রতিরোধমূলক ব্যবস্থা এবং পুনরুদ্ধারের টিপস অন্তর্ভুক্ত।

source: Contact Support
bn: সহায়তা যোগাযোগ করুন

source: Email Support
bn: ইমেইল সহায়তা

source: Get help via email
bn: ইমেইলের মাধ্যমে সহায়তা পান

source: Phone Support
bn: ফোন সহায়তা

source: Call us directly
bn: আমাদের সরাসরি কল করুন

# thisFeatureComingSoon
source: This feature is coming soon!
bn: এই বৈশিষ্ট্যটি শীঘ্রই আসছে!

source: App Information
bn: অ্যাপের তথ্য

source: App Name
bn: অ্যাপের নাম

source: Description
bn: বিবরণ

source: Version
bn: সংস্করণ

source: Package Name
bn: প্যাকেজের নাম

source: Features
bn: বৈশিষ্ট্যসমূহ

source: AI Disease Detection
bn: AI রোগ শনাক্তকরণ

# aiDiseaseDetectionDesc
source: Advanced machine learning for accurate plant disease identification
bn: সঠিক গাছের রোগ শনাক্তকরণের জন্য উন্নত মেশিন লার্নিং

source: Treatment Recommendations
bn: চিকিৎসার পরামর্শ

# treatmentRecommendationsDesc
source: Personalized care guides and treatment solutions
bn: ব্যক্তিগতকৃত যত্নের গাইড এবং চিকিৎসার সমাধান

# detectionHistoryDesc
source: Track your plant health journey over time
bn: সময়ের সাথে আপনার গাছের স্বাস্থ্যের যাত্রা ট্র্যাক করুন

source: Care Guides
bn: যত্নের গাইড

# careGuidesDesc
source: Comprehensive plant care information and tips
bn: ব্যাপক গাছের যত্নের তথ্য এবং টিপস

source: Update Profile
bn: প্রোফাইল আপডেট করুন

source: Profile updated successfully
bn: প্রোফাইল সফলভাবে আপডেট হয়েছে

# failedToUpdateProfile
source: Failed to update profile: {error}
bn: প্রোফাইল আপডেট করতে ব্যর্থ: {error}

source: Updating profile...
bn: প্রোফাইল আপডেট হচ্ছে...

source: Full Name
bn: পূর্ণ নাম

source: Enter your full name
bn: আপনার পূর্ণ নাম লিখুন

source: Profile Photo
bn: প্রোফাইল ছবি

source: Change Photo
bn: ছবি পরিবর্তন করুন

source: Remove Photo
bn: ছবি সরান

source: Save
bn: সংরক্ষণ করুন

# pleaseEnterName
source: Please enter your name
bn: অনুগ্রহ করে আপনার নাম লিখুন

# nameMinLength
source: Name must be at least 2 characters
bn: নাম কমপক্ষে ২টি অক্ষরের হতে হবে

source: Loading detection history...
bn: শনাক্তকরণের ইতিহাস লোড হচ্ছে...

source: Failed to load detection history
bn: শনাক্তকরণের ইতিহাস লোড করতে ব্যর্থ

source: No Detection History
bn: কোন শনাক্তকরণের ইতিহাস নেই

# noDetectionHistoryDescription
source: Your plant disease detection history will appear here once you start scanning plants.
bn: আপনি উদ্ভিদ স্ক্যান করা শুরু করলে আপনার উদ্ভিদ রোগ শনাক্তকরণের ইতিহাস এখানে দেখা যাবে।

source: Total
bn: মোট

source: Diseased
bn: রোগাক্রান্ত

source: Error loading stats
bn: পরিসংখ্যান লোড করতে ত্রুটি

source: Login
bn: লগইন

source: Sign Up
bn: সাইন আপ

source: Welcome Back
bn: ফিরে আসার জন্য স্বাগতম

# signInToContinue
source: Sign in to continue with BAGANI
bn: বাগানির সাথে চালিয়ে যেতে সাইন ইন করুন

source: Email
bn: ইমেইল

source: Enter your email
bn: আপনার ইমেইল লিখুন

source: Password
bn: পাসওয়ার্ড

source: Enter your password
bn: আপনার পাসওয়ার্ড লিখুন

source: Remember Me
bn: আমাকে মনে রাখুন

source: Forgot Password?
bn: পাসওয়ার্ড ভুলে গেছেন?

source: Sign In
bn: সাইন ইন

# dontHaveAccount
source: Don't have an account?
bn: কোন অ্যাকাউন্ট নেই?

source: Create Account
bn: অ্যাকাউন্ট তৈরি করুন

# joinBagani
source: Join BAGANI to start your plant care journey
bn: আপনার উদ্ভিদ পরিচর্যা যাত্রা শুরু করতে বাগানিতে যোগ দিন

source: Confirm Password
bn: পাসওয়ার্ড নিশ্চিত করুন

source: Confirm your password
bn: আপনার পাসওয়ার্ড নিশ্চিত করুন

source: Reset Password
bn: পাসওয়ার্ড রিসেট করুন

# enterEmailForReset
source: Enter your email address and we'll send you a link to reset your password
bn: আপনার ইমেইল ঠিকানা লিখুন এবং আমরা আপনাকে পাসওয়ার্ড রিসেট করার লিংক পাঠাব

# checkEmailForReset
source: Check your email for password reset instructions
bn: পাসওয়ার্ড রিসেট নির্দেশনার জন্য আপনার ইমেইল চেক করুন

source: Enter your email address
bn: আপনার ইমেইল ঠিকানা লিখুন

source: Send Reset Email
bn: রিসেট ইমেইল পাঠান

source: Email Sent!
bn: ইমেইল পাঠানো হয়েছে!

# emailSentTo
source: We've sent password reset instructions to:
bn: আমরা পাসওয়ার্ড রিসেট নির্দেশনা পাঠিয়েছি:

source: Resend Email
bn: ইমেইল আবার পাঠান

source: Remember your password?
bn: আপনার পাসওয়ার্ড মনে আছে?

source: Settings
bn: সেটিংস

source: Account
bn: অ্যাকাউন্ট

# manageAccountInfo
source: Manage your account information
bn: আপনার অ্যাকাউন্ট তথ্য পরিচালনা করুন

source: App Settings
bn: অ্যাপ সেটিংস

source: Language
bn: ভাষা

source: Theme
bn: থিম

source: Support
bn: সহায়তা

source: Help & Support
bn: সাহায্য ও সহায়তা

# getHelpAndContact
source: Get help and contact support
bn: সাহায্য পান এবং সহায়তা যোগাযোগ করুন

source: About
bn: সম্পর্কে

# appVersionAndInfo
source: App version and information
bn: অ্যাপ সংস্করণ এবং তথ্য

source: System Default
bn: সিস্টেম ডিফল্ট

source: Dark
bn: গাঢ়

# scanYourPlantTitle
source: Scan Your Plant
bn: আপনার উদ্ভিদ স্ক্যান করুন

source: Detection Details
bn: শনাক্তকরণের বিবরণ

source: Loading cure suggestion...
bn: চিকিৎসার পরামর্শ লোড হচ্ছে...

source: Retry
bn: আবার চেষ্টা করুন

source: Scan Another Plant
bn: আরেকটি উদ্ভিদ স্ক্যান করুন

source: Delete Record
bn: রেকর্ড মুছুন

# deleteRecordConfirm
source: Are you sure you want to delete this detection record? This action cannot be undone.
bn: আপনি কি নিশ্চিত যে আপনি এই শনাক্তকরণ রেকর্ডটি মুছতে চান? এই কাজটি পূর্বাবস্থায় ফেরানো যাবে না।

source: Signing in...
bn: সাইন ইন হচ্ছে...

source: Page Not Found
bn: পৃষ্ঠা পাওয়া যায়নি

# pageNotFoundDesc
source: The page you are looking for does not exist.
bn: আপনি যে পৃষ্ঠাটি খুঁজছেন তা বিদ্যমান নেই।

source: Go Home
bn: হোমে যান

source: No Data
bn: কোন ডেটা নেই

source: No items found
bn: কোন আইটেম পাওয়া যায়নি

source: Add Item
bn: আইটেম যোগ করুন

source: Failed to load data
bn: ডেটা লোড করতে ব্যর্থ

source: Loading data...
bn: ডেটা লোড হচ্ছে...

# pleaseEnterEmail
source: Please enter your email
bn: অনুগ্রহ করে আপনার ইমেইল লিখুন

# pleaseEnterValidEmail
source: Please enter a valid email
bn: অনুগ্রহ করে একটি বৈধ ইমেইল লিখুন

# pleaseEnterPassword
source: Please enter your password
bn: অনুগ্রহ করে আপনার পাসওয়ার্ড লিখুন

# passwordMinLength
source: Password must be at least 6 characters
bn: পাসওয়ার্ড কমপক্ষে ৬টি অক্ষরের হতে হবে

# pleaseConfirmPassword
source: Please confirm your password
bn: অনুগ্রহ করে আপনার পাসওয়ার্ড নিশ্চিত করুন

source: Passwords do not match
bn: পাসওয়ার্ড মিলছে না

# passwordResetSent
source: Password reset email sent successfully!
bn: পাসওয়ার্ড রিসেট ইমেইল সফলভাবে পাঠানো হয়েছে!

# credentialsCleared
source: Saved credentials cleared successfully
bn: সংরক্ষিত পরিচয়পত্র সফলভাবে মুছে ফেলা হয়েছে

# fetchSuggestionFailed
source: Failed to fetch suggestion:
bn: পরামর্শ আনতে ব্যর্থ:

source: No user found with this email address
bn: এই ইমেইল ঠিকানার সাথে কোনো ব্যবহারকারী পাওয়া যায়নি

source: Incorrect password
bn: পাসওয়ার্ড ভুল হয়েছে

source: Invalid email address
bn: অবৈধ ইমেইল ঠিকানা

source: This account has been disabled
bn: এই অ্যাকাউন্টটি নিষ্ক্রিয় করা হয়েছে

source: Too many failed attempts. Please try again later
bn: অনেকবার ভুল হয়েছে। পরে আবার চেষ্টা করুন

source: Login failed. Please try again
bn: লগইন ব্যর্থ হয়েছে। আবার চেষ্টা করুন

source: An account with this email already exists
bn: এই ইমেইল ঠিকানার সাথে একটি অ্যাকাউন্ট ইতিমধ্যে আছে

# passwordIsTooWeak
source: Password is too weak. Please choose a stronger password
bn: পাসওয়ার্ড খুব দুর্বল। দয়া করে আরও শক্তিশালী পাসওয়ার্ড দিন

source: Email/password accounts are not enabled
bn: ইমেইল/পাসওয়ার্ড অ্যাকাউন্ট সক্রিয় নয়

# signUpFailed
source: Sign up failed. Please try again
bn: সাইন আপ ব্যর্থ হয়েছে। আবার চেষ্টা করুন

source: Creating account...
bn: অ্যাকাউন্ট তৈরি হচ্ছে...

source: Already have an account?
bn: ইতিমধ্যে একটি অ্যাকাউন্ট আছে?
